hrshygoodness/Luminary-Micro-Library/boards/dk-lm3s9b96/enet_io/enet_io.c
    ulIPAddress = lwIPLocalIPAddrGet();

    //
    // If IP Address has not yet been assigned, update the display accordingly
    //
    if(ulIPAddress == 0)
    {
        //
        // Update status bar on the display.  First remove the previous
        // asterisk.
        //
        GrStringDrawCentered(&g_sContext, "  ", 2, lStarPos + STATUS_X,
                             STATUS_Y, true);

        //
        // Are we currently moving the asterisk right or left?
        //
        if(bIncrementing)
        {
            //
            // Moving right.
            //
            lStarPos += ANIM_STEP_SIZE;
            if(lStarPos >= MAX_STATUS_X)
            {
                //
                // We've reached the right boundary so reverse direction.
                //
                lStarPos = MAX_STATUS_X;
                bIncrementing = false;
            }
        }
        else
        {
            //
            // Moving left.
            //
            lStarPos -= ANIM_STEP_SIZE;
            if(lStarPos < 0)
            {
                //
                // We've reached the left boundary so reverse direction.
                //
                lStarPos = 0;
                bIncrementing = true;
            }
        }

        //
        // Draw the asterisk at the new position.
        //
        GrContextForegroundSet(&g_sContext, ClrWhite);
        GrStringDrawCentered(&g_sContext, "*", 2, lStarPos + STATUS_X,
                             STATUS_Y, true);
    }

    //
    // Check if IP address has changed, and display if it has.
    //
    else if(ulLastIPAddress != ulIPAddress)
    {
        ulLastIPAddress = ulIPAddress;

        //
        // Clear the status area.
        //
        sRect.sXMin = STATUS_X - 10;
        sRect.sYMin = STATUS_Y - 30;
        sRect.sXMax = MAX_STATUS_X + 10;
        sRect.sYMax = STATUS_Y + 10;
        GrContextForegroundSet(&g_sContext, ClrBlack);
        GrRectFill(&g_sContext, &sRect);

        GrContextForegroundSet(&g_sContext, ClrWhite);
        GrContextFontSet(&g_sContext, g_pFontCmss18b);
        GrStringDraw(&g_sContext, "IP Address:", -1, 60, STATUS_Y - 20, false);
        GrStringDraw(&g_sContext, "Subnet Mask:", -1, 60, STATUS_Y, false);
        GrStringDraw(&g_sContext, "Gateway:", -1, 60, STATUS_Y + 20, false);
        DisplayIPAddress(ulIPAddress, 170, STATUS_Y - 20);
        ulIPAddress = lwIPLocalNetMaskGet();
        DisplayIPAddress(ulIPAddress, 170, STATUS_Y);
        ulIPAddress = lwIPLocalGWAddrGet();
        DisplayIPAddress(ulIPAddress, 170, STATUS_Y + 20);
    }
}

//*****************************************************************************
//
// This example demonstrates the use of the Ethernet Controller and lwIP
// TCP/IP stack to control various peripherals on the board via a web
// browser.
//
//*****************************************************************************
int
main(void)
{
    unsigned long ulUser0, ulUser1, ulAnimPos, ulColor;
    unsigned char pucMACArray[8];
    tRectangle sRect;

    //
    // Set the system clock to run at 50MHz from the PLL.
    //
    ROM_SysCtlClockSet(SYSCTL_SYSDIV_4 | SYSCTL_USE_PLL | SYSCTL_OSC_MAIN |
                       SYSCTL_XTAL_16MHZ);

    //
    // Set the pinout appropriately for this board.
    //
    PinoutSet();

    //
    // Initialize the display driver.
    //
    Kitronix320x240x16_SSD2119Init();

    //
    // Initialize the graphics context.
    //
    GrContextInit(&g_sContext, &g_sKitronix320x240x16_SSD2119);

    //
    // Fill the top 24 rows of the screen with blue to create the banner.
    //
    sRect.sXMin = 0;
    sRect.sYMin = 0;
    sRect.sXMax = GrContextDpyWidthGet(&g_sContext) - 1;
    sRect.sYMax = 23;
    GrContextForegroundSet(&g_sContext, ClrDarkBlue);
    GrRectFill(&g_sContext, &sRect);

    //
    // Put a white box around the banner.
    //
    GrContextForegroundSet(&g_sContext, ClrWhite);
    GrRectDraw(&g_sContext, &sRect);

    //
    // Put the application name in the middle of the banner.
    //
    GrContextFontSet(&g_sContext, g_pFontCm20);
    GrStringDrawCentered(&g_sContext, "enet-io", -1,
                         GrContextDpyWidthGet(&g_sContext) / 2, 10, 0);

    //
    // Enable and Reset the Ethernet Controller.
    //
    ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_ETH);
    ROM_SysCtlPeripheralReset(SYSCTL_PERIPH_ETH);

    //
    // Enable Port F for Ethernet LEDs.
    //  LED0        Bit 3   Output
    //  LED1        Bit 2   Output
    //
    GPIOPinTypeEthernetLED(GPIO_PORTF_BASE, GPIO_PIN_2 | GPIO_PIN_3);

    //
    // Configure SysTick for a periodic interrupt.
    //
    ROM_SysTickPeriodSet(ROM_SysCtlClockGet() / SYSTICKHZ);
    ROM_SysTickEnable();
    ROM_SysTickIntEnable();

    //
    // Enable processor interrupts.
    //
    ROM_IntMasterEnable();

    //
    // Configure the hardware MAC address for Ethernet Controller filtering of
    // incoming packets.
    //
    // For the LM3S6965 Evaluation Kit, the MAC address will be stored in the
    // non-volatile USER0 and USER1 registers.  These registers can be read
    // using the FlashUserGet function, as illustrated below.
    //
    ROM_FlashUserGet(&ulUser0, &ulUser1);
    if((ulUser0 == 0xffffffff) || (ulUser1 == 0xffffffff))
    {
        //
        // We should never get here.  This is an error if the MAC address
        // has not been programmed into the device.  Exit the program.
        //
        GrStringDrawCentered(&g_sContext, "MAC Address not programmed!", -1,
                             GrContextDpyWidthGet(&g_sContext) / 2,
                             GrContextDpyHeightGet(&g_sContext) / 2, 0);
        while(1);
    }

    //
    // Tell the user what we are doing just now.
    //
    GrStringDrawCentered(&g_sContext, "Waiting for IP", -1,
                         GrContextDpyWidthGet(&g_sContext) / 2,
                         STATUS_Y - 22, false);

    //
    // Draw the box inside which a text string sent from browser will be
    // displayed.
    //
    sRect.sXMin = 0;
    sRect.sXMax = GrContextDpyWidthGet(&g_sContext) - 1;
    sRect.sYMin = TEXT_BOX_TOP;
    sRect.sYMax = TEXT_BOX_BOTTOM - 1;
    GrContextForegroundSet(&g_sContext, ClrWhite);
    GrRectDraw(&g_sContext, &sRect);
    GrContextFontSet(&g_sContext, g_pFontCmss18);
    GrStringDraw(&g_sContext, " Browser Text: ", -1, 6, TEXT_BOX_TOP - 10,
                 true);

    //
    // Draw the box inside which we will draw the animation.
    //
    sRect.sXMin = ANIM_LEFT;
    sRect.sXMax = (ANIM_LEFT + ANIM_WIDTH) - 1;
    sRect.sYMin = ANIM_TOP;
    sRect.sYMax = (ANIM_TOP + ANIM_HEIGHT) - 1;
    GrContextForegroundSet(&g_sContext, ClrWhite);
    GrRectDraw(&g_sContext, &sRect);

    //
    // Initialize the animation variables.
    //
    ulAnimPos = ANIM_LEFT + 1;
    ulColor = ClrRed;

    //
    // Convert the 24/24 split MAC address from NV ram into a 32/16 split
    // MAC address needed to program the hardware registers, then program
    // the MAC address into the Ethernet Controller registers.
    //
    pucMACArray[0] = ((ulUser0 >>  0) & 0xff);
    pucMACArray[1] = ((ulUser0 >>  8) & 0xff);
    pucMACArray[2] = ((ulUser0 >> 16) & 0xff);
    pucMACArray[3] = ((ulUser1 >>  0) & 0xff);
    pucMACArray[4] = ((ulUser1 >>  8) & 0xff);
    pucMACArray[5] = ((ulUser1 >> 16) & 0xff);

    //
    // Initialze the lwIP library, using DHCP.
    //
    lwIPInit(pucMACArray, 0, 0, 0, IPADDR_USE_DHCP);

    //
    // Setup the device locator service.
    //
    LocatorInit();
    LocatorMACAddrSet(pucMACArray);
    LocatorAppTitleSet("DK-LM3S9B96 enet_io");

    //
    // Initialize a sample httpd server.
    //
    httpd_init();

    //
    // Pass our tag information to the HTTP server.
    //
    http_set_ssi_handler(SSIHandler, g_pcConfigSSITags,
                         NUM_CONFIG_SSI_TAGS);

    //
    // Pass our CGI handlers to the HTTP server.
    //
    http_set_cgi_handlers(g_psConfigCGIURIs, NUM_CONFIG_CGI_URIS);

    //
    // Initialize IO controls
    //
    io_init();

    //
    // Loop forever, processing the on-screen animation.  All other work is
    // done in the interrupt handlers.
    //
    while(1)
    {
        //
        // Wait for a new tick to occur.
        //
        while(!g_ulFlags)
        {
            //
            // Do nothing.
            //
        }

        //
        // Clear the flag now that we have seen it.
        //
        HWREGBITW(&g_ulFlags, FLAG_TICK) = 0;

        //
        // Update the bar position and check for wrap.
        //
        ulAnimPos ++;
        if(ulAnimPos == ((ANIM_LEFT + ANIM_WIDTH) - 1))
        {
            //
            // We've reached the right edge so change color and move back
            // to the left.
            //
            ulAnimPos = ANIM_LEFT + 1;
            ulColor += COLOR_INCREMENT;
        }

        //
        // Now we draw the new bar.  Note that we need to temporarily
        // disable the ethernet interrupt while doing this since we have
        // been naughty and set this app up so that it accesses the graphics
        // library from two different contexts.
        //
        ROM_IntDisable(INT_ETH);
        GrContextForegroundSet(&g_sContext, ulColor);
        GrLineDrawV(&g_sContext, ulAnimPos, (ANIM_TOP + 1),
                    (ANIM_TOP + ANIM_HEIGHT) - 2);
        ROM_IntEnable(INT_ETH);
    }
}
